In [1]:
import pandas as pd
from sqlalchemy import create_engine
connection=create_engine('mysql+mysqlconnector://root:Mysql@localhost:3306/Ineuron')
engine=connection.connect()

In [2]:
#Q-19. Write an SQL query to determine the 5th highest salary without using TOP or limit method.
query="""SELECT salary FROM (SELECT salary, DENSE_RANK() OVER (ORDER BY salary DESC) AS salary_rank FROM worker) AS ranked_salaries
WHERE salary_rank = 5;"""
df=pd.read_sql(query,engine)
df

   salary
0   82000

In [3]:
#Q-20. Write an SQL query to fetch the list of employees with the same salary.
query="SELECT Salary, GROUP_CONCAT(first_name) AS workersWithSameSalary FROM worker GROUP BY Salary HAVING COUNT(*) > 1;"
df=pd.read_sql(query,engine)
df

   Salary workersWithSameSalary
0   60000       John,John,Emily
1   65000          Robert,David
2   70000       Alice,Ella,Mike
3   75000       Jane,Mia,Satish
4   89000          Nathan,Vipul

In [4]:
engine.close()